[
    {
        "id": 1,
        "courseName": "C",
        "courseDetails": "What is C------------------? The C programming language was first released back in 1972. It's a high-level procedural language that has become one of the most widely-used ones out there. Despite its age, it's still a relatively complex language, yet its influence can be seen in many others. C#, C++, Java, Python, and more all take elements of inspiration from C. Why is C used for----------------? C is a versatile language that has uses in many different areas. It's mainly used for creating system applications, meaning that operating systems such as Windows and Linux use a lot of C programming. You can also use C to create games, graphics, and apps that use lots of calculations. How to learn C-----------------!! If you're a newcomer to the world of coding and programming, C is a fairly difficult place to start. There are other high-level languages such as Python that offer a better starting point. That being said, there are plenty of online resources for learning C."
    },
    {
        "id": 2,
        "courseName": "Java",
        "courseDetails": "What is Java---------------? Java is a hugely popular object-oriented programming language. Part of its popularity comes from the fact that once you write a piece of code in Java, it can run on just about any device with the Java platform. What is Java used for-----------------? The 'write once, run anywhere' concept at the heart of Java means it has many different uses. However, some of the main uses include for business software, web applications, and mobile apps. Google's Android OS, for example, uses Java as its native language. How to learn Java------------------!! You can get started with the basics of Java programming with our free courses on building your first mobile game. This will introduce you to some of the essential concepts and constructs of Java."
    },
    {
        "id": 3,
        "courseName": "JavaScript",
        "courseDetails": "What is JavaScript----------------?  JavaScript is a high-level, object-oriented programming language (although that second point is up for some debate). The language was created in the early days of the internet, back in 1995. You'll find that all major web browsers have JavaScript support.What is JavaScript used for-------------------? As mentioned, JavaScript is a language used to write code that runs in web browsers. As such, it has a wide range of applications and is especially useful for making web pages interactive and responsive. It's often used alongside HTML and CSS to add things like animations, video players, and even browser-based games. How to learn JavaScript---------------------!! If you're new to coding with JavaScript, HTML and CSS, our Introduction to Web Development course is the ideal place to start. Here, you'll learn how to build your own interactive website using the languages."
    },
    {
        "id": 4,
        "courseName": "PHP",
        "courseDetails": "What is PHP-------------------? PHP: Hypertext Preprocessor is a high-level, object-oriented programming language. Although similar to JavaScript in some ways, PHP is a server-side rather than client-side scripting language that is embedded in HTML. As such, it is often used together with JavaScript. As one analogy puts it, if PHP is the paintbrush, JavaScript is the paint. What is PHP used for---------------------? There are many uses for PHP, although mostly for website development. You can use it to manage dynamic content and databases on a website, for example. The latter is particularly relevant, as it integrates well with database languages such as MySQL. How to learn PHP---------------!! As with many coding languages, the best way to learn is to get as much practice as you can with the language. There are many resources available that will take you through the basics, such as how the language works and what the basic syntax looks like. "
    },
    {
        "id": 5,
        "courseName": "Python",
        "courseDetails": "What is Python-------------------? Python is an object-oriented, high-level programming language launched in 1992. It's built in such a way that it's relatively intuitive to write and understand, making it ideal for those who want rapid development. It's a very popular language right now, meaning there are plenty of Python jobs available.Why is Python used for--------------------? Because of how versatile a language it is, Python has many applications. As well as being good for general use, such as for web applications, it also has many areas of specialisation. A good example of the latter is for artificial intelligence (AI) and machine learning.How to learn Python---------------!! We have a range of free Python courses that can get you started with some of the basics. Programming for Everybody is the ideal place if you're totally new to programming."
    },
    {
        "id": 6,
        "courseName": "R",
        "courseDetails": "What is R-----------------? R is a low-level, functional programming language and software environment, mainly aimed at statistical computing and graphical techniques. There is a vast library of tools that come with the language, including machine learning algorithms and other useful tools.Why is R used for------------------? Statisticians and data miners often use R to develop things like statistical software and data analysis packages. It's also useful for professionals such as demographers, data scientists, and insurance actuaries to gain statistical insights.How to learn R--------------!! A great place to start with programming in this language is with our Data Science on Microsoft Azure using R Programming ExpertTrack. As you work your way through it,you'll learn R programming and develop your data science skills."
    }
]